Catalogs/КатегорииПолучателейСтимулирующихВыплатФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>КатегорииПолучателейСтимулирующихВыплатФСС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолучательСтимулирующихВыплатФСС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПолучательСтимулирующихВыплатФСС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКатегории</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>800</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОказываетМедицинскуюПомощьCOVID</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтдельнаяКатегорияМедицинскихРаботников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выплата</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ПолучательСтимулирующихВыплатФСС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ПолучательСтимулирующихВыплатФСС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяОрганизация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОрганизацияСоциальногоОбслуживания</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КатегорииПолучателейСтимулирующихВыплатФСС/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Возвращает реквизиты справочника, которые образуют естественный ключ
//  для элементов справочника.
// Используется для сопоставления элементов механизмом «Выгрузка/загрузка областей данных».
//
// Возвращаемое значение:
//  Массив(Строка) - массив имен реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	
	Результат = Новый Массив;
	
	Результат.Добавить("Код");
	Результат.Добавить("НаименованиеКатегории");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Код");
	Поля.Добавить("НаименованиеКатегории");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = СтрШаблон(НСтр("ru = '(%1) %2'"), Данные.Код, Данные.НаименованиеКатегории);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиПравилРегистрации

// См. ЗарплатаКадрыРасширенныйСинхронизацияДанных.ШаблонОбработчика
Процедура ПриЗаполненииНастроекОбработчиковПравилРегистрации(Настройки) Экспорт
	ЗарплатаКадрыРасширенныйСинхронизацияДанных.ДляРегламентированныхДанных(Настройки);
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПервоначальногоЗаполненияИОбновленияИБ
	
Функция ТаблицаКлассификатора()
	
	ТаблицаКлассификатора = Новый ТаблицаЗначений;
	ТаблицаКлассификатора.Колонки.Добавить("Код");
	ТаблицаКлассификатора.Колонки.Добавить("НаименованиеКатегории");
	ТаблицаКлассификатора.Колонки.Добавить("ПолучательСтимулирующихВыплатФСС");
	ТаблицаКлассификатора.Колонки.Добавить("ОказываетМедицинскуюПомощьCOVID");
	ТаблицаКлассификатора.Колонки.Добавить("ОтдельнаяКатегорияМедицинскихРаботников");
	ТаблицаКлассификатора.Колонки.Добавить("Выплата");
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "1";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.ОрганизацияСоциальногоОбслуживания;	
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "2";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал, в том числе фельдшер, медицинский дезинфектор, лаборант, медицинская сестра по массажу, медицинская сестра процедурной, медицинская сестра по физиотерапии, старшая медицинская сестра, инструктор по лечебной физкультуре, инструктор-методист по лечебной физкультуре'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.ОрганизацияСоциальногоОбслуживания;	
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "3";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Социальный работник, специалист по социальной работе, специалист по работе с семьей, специалист по реабилитационной работе в социальной сфере, психолог в социальной сфере, педагогический работник, в том числе воспитатель, инструктор по труду, логопед, музыкальный руководитель, педагог-библиотекарь, педагог-организатор, педагог-психолог, социальный педагог, педагог-дефектолог, учитель-логопед, административно-управленческий персонал'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.ОрганизацияСоциальногоОбслуживания;	
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "4";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинскоий персонал, в том числе сестра-хозяйка, санитар, сиделка (помощник по уходу), - в случае невыявления в стационарной организации социального обслуживания, стационарном отделении новой коронавирусной инфекции (COVID-19) 15 тыс. рублей, в случае выявления - 20 тыс. рублей'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.ОрганизацияСоциальногоОбслуживания;	
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "5";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Технический персонал, персонал, занятый на иных должностях'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.ОрганизацияСоциальногоОбслуживания;	
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "11";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач, оказывающий скорую медицинскую помощь, выездной бригады скорой медицинской помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "12";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач, оказывающий специализированную медицинскую помощь в стационарных условиях'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "13";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач, оказывающий первичную медико-санитарную помощь'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "14";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач патолого-анатомического бюро (отделения медицинской организации), проводящий  патолого-анатомические исследования, связанные с новой коронавирусной инфекцией (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "15";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врач, не оказывающий  медицинскую помощь по диагностике и лечению новой коронавирусной инфекции COVID-19, контактирующий с пациентом с установленным диагнозом новой коронавирусной инфекции COVID-19 при выполнении должностных обязанностей'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "22";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинский работник с высшим (немедицинским) образованием, оказывающий специализированную медицинскую помощь в стационарных условиях'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "23";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинский работник с высшим (немедицинским) образованием, оказывающий первичную медико-санитарную помощь'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "24";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинский работник с высшим (немедицинским) образованием патолого-анатомического бюро (отделения медицинской организации), проводящий  патолого-анатомические исследования, связанные с новой коронавирусной инфекцией (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "25";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинский работник с высшим (немедицинским) образованием, не оказывающий  медицинскую помощь по диагностике и лечению новой коронавирусной инфекции COVID-19, контактирующий с пациентом с установленным диагнозом новой коронавирусной инфекции COVID-19 при выполнении должностных обязанностей'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "31";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал, участвующий в оказании скорой медицинской помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "32";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал, участвующий в оказании медицинской помощи в стационарных условиях'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "33";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал, участвующий в оказании первичной медико-санитарной помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "34";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал патолого-анатомического бюро (отделения медицинской организации), проводящий (обеспечивающий условия для проведения) патолого-анатомические исследования, связанные с новой коронавирусной инфекцией (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "35";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Средний медицинский персонал, не оказывающий  медицинскую помощь по диагностике и лечению новой коронавирусной инфекции COVID-19, контактирующий с пациентом с установленным диагнозом новой коронавирусной инфекции COVID-19 при выполнении должностных обязанностей'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "41";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал, обеспечивающий оказание скорой медицинской помощи, выездной бригады скорой медицинской помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "42";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал, обеспечивающий оказание специализированной медицинской помощи в стационарных условиях'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "43";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал, обеспечивающий оказание первичной медико-санитарной медицинской помощи в амбулаторных условиях'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "44";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал патолого-анатомического бюро  (отделения медицинской организации) , обеспечивающий условия) для проведения патолого-анатомических исследований, связанных с новой коронавирусной инфекцией (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "45";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал, не оказывающий  медицинскую помощь по диагностике и лечению новой коронавирусной инфекции COVID-19, контактирующий с пациентом с установленным диагнозом новой коронавирусной инфекции COVID-19 при выполнении должностных обязанностей'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "51";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Водитель машины выездной бригады скорой медицинской помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "61";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Водитель машины выездной бригады скорой медицинской помощи, занятый в организации, предоставляющей транспортные услуги'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "71";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Член летного экипажа санитарной авиации, осуществляющий медицинскую эвакуацию пациентов с новой коронавирусной инфекцией (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "81";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Член летного экипажа санитарной авиации, занятый в организации, предоставляющей транспортные услуги осуществляющий медицинскую эвакуацию пациентовс новой коронавирусной инфекцией (COVID-19)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "91";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Фельдшер (медицинская сестра) по приему вызовов скорой медицинской помощи и передаче их выездным бригадам скорой медицинской помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Истина;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Ложь;

	
	
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "16";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врачи центральных районных, районных и участковых больниц'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 18500;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "17";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врачи, к которым обращаются (которых посещают) граждане по поводу заболеваний (состояний) или с профилактической целью, включая проведение исследований, работающие в медицинских организациях, оказывающих первичную медико-санитарную помощь по территориально-участковому принципу прикрепленному населению, а также осуществляющие диспансерное наблюдение граждан по основному заболеванию (состоянию)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 14500;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "18";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врачи, осуществляющие прижизненные гистологические и цитологические исследования по направлениям врачей центральных районных, районных и участковых больниц и врачей, к которым обращаются (которых посещают) граждане по поводу заболеваний (состояний) или с профилактической целью, включая проведение исследований, работающих в медицинских организациях, оказывающих первичную медико-санитарную помощь по территориально-участковому принципу прикрепленному населению, а также осуществляющих диспансерное наблюдение граждан по основному заболеванию (состоянию)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 11500;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "19";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Врачи станций (отделений) скорой медицинской помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 11500;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "28";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинские работники с высшим (немедицинским) образованием, осуществляющие прижизненные гистологические и цитологические исследования по направлениям врачей центральных районных, районных и участковых больниц и врачей, к которым обращаются (которых посещают) граждане по поводу заболеваний (состояний) или с профилактической целью, включая проведение исследований, работающих в медицинских организациях, оказывающих первичную медико-санитарную помощь по территориально-участковому принципу прикрепленному населению, а также осуществляющих диспансерное наблюдение граждан по основному заболеванию (состоянию)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 11500;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "36";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Специалисты со средним медицинским образованием центральных районных, районных и участковых больниц'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 8000;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "37";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Специалисты со средним медицинским образованием, работающие с врачами, к которым обращаются (которых посещают) граждане по поводу заболеваний (состояний) или с профилактической целью, включая проведение исследований, работающие в медицинских организациях, оказывающих первичную медико-санитарную помощь по территориально-участковому принципу прикрепленному населению, а также осуществляющие диспансерное наблюдение граждан по основному заболеванию (состоянию), а также оказывающие первичную медико-санитарную помощь по поводу заболеваний (состояний) или с профилактической целью, включая проведение исследований, по территориально-участковому принципу прикрепленному населению и  (или) осуществляющие диспансерное наблюдение граждан по основному заболеванию (состоянию)'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 6500;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "46";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал центральных районных, районных и участковых больни'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 4500;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "47";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал медицинских организаций, оказывающих первичную медико-санитарную помощь гражданам по территориально-участковому принципу'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 4500;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "49";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Младший медицинский персонал станций (отделений) скорой медицинской помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 4500;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "99";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинские сестры (фельдшеры) по приему вызовов скорой медицинской помощи и передаче их выездным бригадам скорой медицинской помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 4500;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "109";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Медицинские сестры станций (отделений) скорой медицинской помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 7000;
	
	НоваяСтрокаКлассификатора = ТаблицаКлассификатора.Добавить();
	НоваяСтрокаКлассификатора.Код = "119";
	НоваяСтрокаКлассификатора.НаименованиеКатегории = НСтр("ru = 'Фельшеры станций (отделений) скорой медицинской помощи'");
	НоваяСтрокаКлассификатора.ПолучательСтимулирующихВыплатФСС = Перечисления.ПолучательСтимулирующихВыплатФСС.МедицинскаяОрганизация;
	НоваяСтрокаКлассификатора.ОказываетМедицинскуюПомощьCOVID = Ложь;
	НоваяСтрокаКлассификатора.ОтдельнаяКатегорияМедицинскихРаботников = Истина;
	НоваяСтрокаКлассификатора.Выплата = 7000;
	
	
	Возврат ТаблицаКлассификатора;
	
КонецФункции

Процедура НачальноеЗаполнение() Экспорт
	
	ОбновитьСправочникИзКлассификатора();
	
КонецПроцедуры	

Процедура ОбновитьСправочникИзКлассификатора()
	
	ТаблицаКлассификатора = ТаблицаКлассификатора();
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииПолучателейСтимулирующихВыплатФСС.Код КАК Код,
	|	КатегорииПолучателейСтимулирующихВыплатФСС.НаименованиеКатегории КАК НаименованиеКатегории,
	|	КатегорииПолучателейСтимулирующихВыплатФСС.Ссылка,
	|	ЛОЖЬ КАК Актуален
	|ИЗ
	|	Справочник.КатегорииПолучателейСтимулирующихВыплатФСС КАК КатегорииПолучателейСтимулирующихВыплатФСС
	|ГДЕ
	|	НЕ КатегорииПолучателейСтимулирующихВыплатФСС.ПометкаУдаления";
	
	ТаблицаСуществующих = Запрос.Выполнить().Выгрузить();
	ТаблицаСуществующих.Индексы.Добавить("Код");
	
	Для Каждого СтрокаКлассификатора Из ТаблицаКлассификатора Цикл
		
		НайденныйЭлемент = ТаблицаСуществующих.Найти(СтрокаКлассификатора.Код, "Код");
		
		Если НайденныйЭлемент = Неопределено Тогда
			СправочникОбъект = Справочники.КатегорииПолучателейСтимулирующихВыплатФСС.СоздатьЭлемент();
		Иначе
			СправочникОбъект = НайденныйЭлемент.Ссылка.ПолучитьОбъект();
			НайденныйЭлемент.Актуален = Истина;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СправочникОбъект, СтрокаКлассификатора); 
		СправочникОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
		
	КонецЦикла;
	
	НеАктуальныеКатегории = ТаблицаСуществующих.НайтиСтроки(Новый Структура("Актуален",Ложь));
	Для Каждого НеАктуальнаяКатегория Из НеАктуальныеКатегории Цикл
		СправочникОбъект = НеАктуальнаяКатегория.Ссылка.ПолучитьОбъект();
		СправочникОбъект.ДополнительныеСвойства.Вставить("ЗаписьОбщихДанных");
		ОбновлениеИнформационнойБазы.УдалитьДанные(СправочникОбъект);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
	
#КонецЕсли
